fe40/tutorials/rheoFoam/Contraction41/Oldroyd-BLog/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
       type           uCos;
       tlim           1.;
       fac            8.;
       uav            (0.25 0 0);
       dirN           (1 0 0);
       value          uniform ( 0 0 0 );
    }
    
    outlet
    {
        type            zeroGradient;
    }

    "(wall.*)"
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }

    frontAndBack
    {
        type             empty;
    }
    
}

// ************************************************************************* //
